/*
 * BEEP - Translations - VUE app v3 (Q4 2021)
 * Author: Julia BD (julia@beep.nl)
 *
 */
const translations = {
  /* Date picker */
  monthsFull: [
    'Січень',
    'Лютий',
    'Березень',
    'Квітень',
    'Травень',
    'Червень',
    'Липень',
    'Серпень',
    'Вересень',
    'Жовтень',
    'Листопад',
    'Грудень',
  ],
  monthsShort: [
    'Січ',
    'Лют',
    'Бер',
    'Кві',
    'Трав',
    'Чер',
    'Лип',
    'Серп',
    'Вер',
    'Жовт',
    'Лист',
    'Груд',
  ],
  Close: 'Закрити',

  /* main */
  Website: 'Вебсайт',
  menu: 'Меню',
  weather: 'Погода',
  sensors: 'Пристрої',

  Delete: 'Видалити',
  Search: 'Пошук...',

  /* user error messages */
  User_data: 'Дані користувача',
  user_data: 'дані користувача',
  updated: 'оновлено',
  delete_complete_account:
    'Ви впевнені, що хочете видалити свій обліковий запис, включаючи всі пасіки, вулики та огляди? Це незворотно.',
  username_is_required: "Будь ласка, введіть ім'я користувача",
  username_already_exists: "Ім'я користувача вже існує",
  password_is_required: 'Будь ласка, введіть пароль',
  email_is_required: 'Будь ласка, введіть адресу електронної пошти',
  email_already_exists: 'Ця адреса електронної пошти вже використовується',
  policy_accepted_is_required:
    'Ви повинні прийняти умови використання для реєстрації',

  already_registered: 'Я вже зареєстрований',
  invalid_user: 'Невідомий користувач або невірний пароль',
  no_password_match: 'Паролі не співпадають',
  invalid_token: 'Недійсний код',

  no_valid_email: 'Недійсна адреса електронної пошти',

  empty_fields: 'Будь ласка, заповніть всі поля',
  match_passwords: 'Паролі не співпадають',

  succesfully_registered: 'Ви успішно зареєстровані.',
  authentication_failed: 'Помилка автентифікації',

  remove_apiary: 'Видалити пасіку',
  remove_hive: 'Видалити вулик',
  remove_inspection: 'Видалити огляд',

  Error: 'Помилка | Помилки',
  first_remove_hives:
    'Увага: на цій пасіці ще є вулики. Ви можете зберегти певні вулики (та їхні огляди), спочатку перемістивши їх на іншу пасіку. Якщо ви продовжите видалення, буде видалено ВСІ вулики та огляди на цій локації.',

  Date: 'Дата',
  ok: 'Ок',
  prev: 'Попередній',
  next: 'Наступний',
  add: 'Додати',
  Cancel: 'Скасувати',

  /* login */
  login_title: 'Вхід',
  login: 'Увійти',
  forgot_password: 'Забули пароль?',

  username: "Ім'я користувача",
  password: 'Пароль',
  confirm_password: 'Підтвердьте пароль',
  email: 'E-mail',

  create_login_question: 'Ще не маєте облікового запису? Зареєструйтеся',
  create_login: 'Зареєструватися',
  create_login_summary: 'Створити новий обліковий запис',
  save: 'Зберегти',

  logout: 'Вийти',

  /* password recovery */
  password_recovery_title: 'Забули пароль?',
  password_recovery_remembered: 'О, тепер я згадав свій пароль!',
  password_recovery_send_mail: 'Надіслати код підтвердження',
  password_recovery_code_not_received: 'Не отримали код протягом 5 хвилин?',
  password_recovery_enter_code:
    'Вже отримали код підтвердження? Введіть його тут',
  password_recovery_reset_password: 'Змінити пароль',
  password_recovery_reminder_success:
    'Лист надіслано. Перейдіть за посиланням у вашому листі, щоб скинути пароль для цього облікового запису.',

  password_recovery_reset_success:
    'Ваш пароль успішно змінено, і ви увійшли в систему.',

  new_password: 'Новий пароль',
  confirm_new_password: 'Підтвердьте новий пароль',

  go_to_dashboard: 'Перейти до моєї панелі управління',
  color: 'Колір',

  /* hives */
  Hive: 'Вулик | Вулики',
  hive: 'вулик | вулики',
  Location: 'Пасіка | Пасіки',
  location: 'пасіка | пасіки',
  Name: "Ім'я",
  name: "ім'я",
  Type: 'Тип',
  type: 'тип',
  inspection: 'огляд | огляди',
  Inspection: 'Огляд | Огляди',
  New_inspection: 'Новий огляд',
  Edit_inspection: 'Редагувати огляд',
  Action: 'Дія | Дії',
  edit: 'Редагувати',
  Bee_race: 'Порода бджіл',
  Birth_date: 'Дата народження',
  Queen_colored: 'Матка позначена',
  Queen_clipped: 'Матка підрізана',
  Queen_fertilized: 'Матка запліднена',
  Age: 'Вік',
  years_old: 'років',

  /* Hive check items */
  Date_of_inspection: 'Дата огляду',
  reminder: "Запам'ятати",
  remind_date: 'Дата нагадування',
  overall: 'Загалом',
  positive_impression: 'Загальне враження',
  needs_attention: 'Потрібно уваги',
  notes: 'Примітки',
  notes_for_next_inspection:
    'Коротка примітка для наступного огляду (видно на огляді)',
  Not_implemented_yet: 'Цей елемент ще не реалізовано',

  /* dashboard */
  last_measurement: 'Останнє вимірювання',
  no_data: 'Дані відсутні',
  no_chart_data: 'Немає даних для графіка за обраний період',

  /* settings */
  General: 'Загальні',
  Place: 'Локація',
  Country: 'Країна',
  City: 'Місто',
  Address: 'Адреса',
  latitude: 'широта',
  Longitude: 'довгота',
  Street: 'Вулиця',
  Number: 'Номер',
  Postal_code: 'Поштовий код',
  Description: 'Опис',
  Hive_amount: 'Кількість вуликів',
  Hive_prefix: 'Префікс назви вулика (перед номером)',
  Hive_number_offset: 'Початковий номер вуликів',
  Hive_type: 'Тип вулика',
  Hive_layers: 'Секції вулика',
  Hive_frames: 'Рамки на секцію',
  Hive_color: 'Колір вулика',
  Queen: 'Матка',
  queen: 'матка',

  settings_title: 'Налаштування',
  Settings: 'Налаштування',
  settings: 'налаштування',

  Select: 'Вибрати',
  Poor: 'Погано',
  Fair: 'Задовільно',
  Average: 'Середній',
  Average_slider: 'Середній',
  Good: 'Добре',
  Excellent: 'Чудово',
  Low: 'Низький',
  Medium: 'Середній',
  High: 'Високий',
  Extreme: 'Екстремальний',

  /* colors */
  select_color: 'Вибрати колір',
  advanced: 'Розширений',

  /* sensors */
  Select_sensor: 'Вибрати сенсор',
  temperature: 'Температура',
  t: 'Температура',
  t_0: 'Температура 1',
  t_1: 'Температура 2',
  t_2: 'Температура 3',
  t_3: 'Температура 4',
  t_4: 'Температура 5',
  t_5: 'Температура 6',
  t_6: 'Температура 7',
  t_7: 'Температура 8',
  t_8: 'Температура 9',
  t_9: 'Температура 10',
  light: 'Світло',
  l: 'Світло',
  water: 'Вода',
  w: 'Вага (старе)',
  humidity: 'Вологість',
  h: 'Вологість',
  air_pressure: 'Атмосферний тиск',
  p: 'Атмосферний тиск',
  weight: 'Вага',
  w_v: 'Значення датчика ваги всіх сенсорів',
  w_fl: 'Значення датчика ваги передній лівий',
  w_fr: 'Значення датчика ваги передній правий',
  w_bl: 'Значення датчика ваги задній лівий',
  w_br: 'Значення датчика ваги задній правий',
  weight_kg: 'Вага',
  weight_kg_corrected: 'Вага (коригована)',
  weight_combined_kg: 'Комбінована вага',
  bat_volt: 'Батарея',
  bv: 'Напруга батареї',
  sound_fanning_4days: 'Обмахування. 4-денні бджоли',
  s_fan_4: 'Обмахування. 4-денні бджоли',
  sound_fanning_6days: 'Обмахування. 6-денні бджоли',
  s_fan_6: 'Обмахування. 6-денні бджоли',
  sound_fanning_9days: 'Обмахування. 9-денні бджоли',
  s_fan_9: 'Обмахування. 9-денні бджоли',
  sound_flying_adult: 'Літаючі бджоли',
  s_fly_a: 'Літаючі бджоли',
  sound_total: 'Загальний звук',
  s_tot: 'Загальний звук',
  s_spl: 'Рівень звукового тиску',
  bee_count_in: 'Кількість бджіл всередині',
  bc_i: 'Кількість бджіл всередині',
  bee_count_out: 'Кількість бджіл ззовні',
  bc_o: 'Кількість бджіл ззовні',
  t_i: 'Температура всередині',
  rssi: 'Сила сигналу',
  snr: 'Шум сигналу',
  lat: 'широта',
  lon: 'довгота',
  Sound_measurements: 'Звукові вимірювання',
  Sensor_info: 'Інформація про сенсор',
  s_bin098_146Hz: '098-146Hz',
  s_bin146_195Hz: '146-195Hz',
  s_bin195_244Hz: '195-244Hz',
  s_bin244_293Hz: '244-293Hz',
  s_bin293_342Hz: '293-342Hz',
  s_bin342_391Hz: '342-391Hz',
  s_bin391_439Hz: '391-439Hz',
  s_bin439_488Hz: '439-488Hz',
  s_bin488_537Hz: '488-537Hz',
  s_bin537_586Hz: '537-586Hz',
  s_bin_71_122: '071-122Hz',
  s_bin_122_173: '122-173Hz',
  s_bin_173_224: '173-224Hz',
  s_bin_224_276: '224-276Hz',
  s_bin_276_327: '276-327Hz',
  s_bin_327_378: '327-378Hz',
  s_bin_378_429: '378-429Hz',
  s_bin_429_480: '429-480Hz',
  s_bin_480_532: '480-532Hz',
  s_bin_532_583: '532-583Hz',
  s_bin_0_201: '0-201Hz',
  s_bin_201_402: '201-402Hz',
  s_bin_402_602: '402-602Hz',
  s_bin_602_803: '602-803Hz',
  s_bin_803_1004: '803-1004Hz',
  s_bin_1004_1205: '1004-1205Hz',
  s_bin_1205_1406: '1205-1406Hz',
  s_bin_1406_1607: '1406-1607Hz',
  s_bin_1607_1807: '1607-1807Hz',
  s_bin_1807_2008: '1807-2008Hz',
  icon: 'Іконка',
  precipIntensity: 'Інтенсивність опадів',
  precipProbability: 'Ймовірність опадів',
  precipType: 'Тип опадів',
  outsideTemperature: 'Температура зовні',
  apparentTemperature: 'Відчутна температура',
  dewPoint: 'Точка роси',
  pressure: 'Атмосферний тиск',
  windSpeed: 'Швидкість вітру',
  windGust: 'Пориви вітру',
  windBearing: 'Напрям вітру',
  cloudCover: 'Хмарність',
  uvIndex: 'Індекс УФ',
  visibility: 'Видимість',
  ozone: 'Озон',

  /* Measurements */
  Hour: 'Година',
  hour: 'година | години',
  day: 'день | дні',
  week: 'Тиждень',
  month: 'Місяць',
  year: 'Рік',

  /* settings */
  offline: "Немає з'єднання",
  yes: 'Так',
  no: 'Ні',

  Checklist: 'Чек-лист | Чек-листи',
  checklist: 'чек-лист | чек-листи',
  Checklist_items: 'Пункти чек-листа',

  /* user */
  Data_export: 'Експорт даних',
  Export_your_data:
    'Експортуйте всі дані, що є у вашому акаунті BEEP, і надішліть електронною поштою файл Excel з даними або завантажте файл Excel тут. Файл Excel має різні вкладки з особистими даними, даними про вулики, локації та огляди.',
  Email_export: 'CSV електронною поштою ',
  Download_csv: 'Завантажити CSV',
  Open_csv: 'Відкрити CSV',
  Include_group_data: 'Додати дані співпрацюючої групи до експорту',
  Include_sensor_data: 'Додати посилання на файли даних вимірювань до експорту',

  accept_policy:
    'Я приймаю умови надання послуг BEEP, що відповідають новому європейському законодавству про конфіденційність',
  policy_url: 'https://beep.nl/terms-of-service',
  policy_version: 'beep_terms_2018_05_25_avg_v1',

  /* General items */
  server_down:
    'Додаток недоступний через технічні роботи, будь ласка, спробуйте пізніше',
  add_to_calendar: 'Додати до календаря',
  Whats_new: 'Новинка!',
  Site_title: 'BEEP | Бджолинний моніторинг',
  email_verified: 'Ваша електронна пошта була підтверджена.',
  email_not_verified: 'Ваша електронна пошта ще не підтверджена.',
  email_new_verification:
    'Натисніть на це посилання, щоб надіслати новий лист для підтвердження електронної пошти.',
  email_verification_sent:
    'Повідомлення з посиланням для підтвердження було надіслано на вашу електронну пошту. Натисніть на посилання в листі, щоб активувати акаунт та увійти.',
  email_verification_resent:
    'Новий лист з посиланням для підтвердження був надісланий на вашу електронну пошту. Натисніть на посилання в листі, щоб активувати акаунт та увійти.',

  not_filled: "не заповнено, хоча це обов'язково",
  cannot_deselect:
    "Неможливо видалити цей елемент, оскільки він містить обов'язковий елемент",
  Undelete: 'Скасувати видалення',
  the_field: 'Поле',
  is_required: "обов'язкове",

  not_available_yet:
    'ще не доступно. Натисніть на кнопку в правому верхньому куті, щоб додати один.',
  member: 'учасник | учасники',
  Member: 'Учасник групи | Учасники групи',
  Invited: 'Запрошений',
  Invitation: 'Запрошення | Запрошення',
  Admin: 'Адміністратор',
  Creator: 'Власник групи',
  Group: 'Співпрацююча група | Співпрацюючі групи',
  group: 'співпрацююча група | співпрацюючі групи',
  group_short: 'група | групи',
  to_share:
    'щоб поділитися з цією групою. 1 клік = учасники групи можуть тільки переглядати, 2 кліки = учасники групи можуть редагувати',
  Invitation_accepted: 'Запрошення прийнято',
  Accept: 'Прийняти',
  My_shared: 'Мої спільні',
  invitee_name: "Ім'я запрошеного",
  Remove_group:
    'Ви впевнені, що хочете повністю видалити цю спільну групу для всіх її учасників?',
  Detach_from_group: 'Видалити мене та мої вулики з цієї групи',
  my_hive: 'Мій вулик',
  created: 'створено',
  group_detached: 'Успішно. Ви вийшли з групи',
  group_activated: 'Запрошення до групи прийняте',
  group_declined: 'Запрошення до групи відхилено',

  /* New translations v2.2.0 */
  roofed: 'Чи має вулик дах?',
  info: 'Інформація',

  research: 'Дослідження',
  start_date: 'Дата початку',
  end_date: 'Дата завершення',
  institution: 'Дослідницька організація',
  type_of_data_used: 'Використання даних',
  link: 'Посилання',
  Consent: 'Згода',
  history: 'історія',
  Current_consent: 'Поточна згода',
  consent_yes: 'Я даю згоду на поширення даних',
  consent_no: 'Я НЕ даю згоду на поширення даних',
  my_beep_data: 'Мої власні дані BEEP',
  Consent_can_only_be_set: 'Згоду можна встановити лише на',
  earlier: 'раніше',
  later: 'пізніше',

  new_apiary_explanation: 'Створіть нову пасіку за 4 кроки',
  start_here: 'Натисніть тут, щоб почати',
  optional: "необов'язково",
  dimensions: 'розміри',
  details: 'деталі',
  configuration: 'конфігурація',
  adjustments: 'налаштування',
  changes_queen_color: 'редагування змінює колір',

  Brood_box_and_frame: 'Рамка та корпус',
  Hive_order: 'Порядок вуликів на пасіці',
  bb_width_cm: 'Ширина розплідного корпусу (см)',
  bb_height_cm: 'Висота розплідного корпусу (см)',
  bb_depth_cm: 'Глибина розплідного корпусу (см)',
  fr_width_cm: 'Ширина рамки (см)',
  fr_height_cm: 'Висота рамки (см)',
  queen_line: 'лінія',
  queen_tree: 'дерево' /********************************************/,
  queen_description: 'примітки',
  Hive_short: 'Вулик | Вулики',

  Image: 'Зображення | Зображення',
  preview: 'попередній перегляд',

  Inside: 'Вимірювання всередині',
  Offset: 'Зміщення',
  Multiplier: 'Множник',
  Input: 'Вхід',
  Output: 'Вихід',
  Last: 'Останній',

  Export_sensor_data:
    "Експортуйте всі дані з пристроїв з максимальною можливою роздільною здатністю у форматі .csv, який можна відкрити в Excel або SPSS. Примітка: Дані про час у стовпці 'час' вказані в GMT, форматовані за стандартом дати та часу RFC 3339.",
  CSV_export_separator: 'Роздільник стовпців у CSV файлі',
  Sensor_measurements: 'Вимірювання датчиків',
  too_much_data:
    'Занадто багато даних для обробки, будь ласка, виберіть менше вимірювань датчиків або зменште проміжок часу між датою початку та кінця.',

  beep_base_explanation:
    "Якщо у вас є BEEP база (зображена на фото вище), будь ласка, використовуйте додаток BEEP base (iOS та Android), щоб налаштувати комунікацію з цим додатком. Якщо у вас ще немає BEEP бази, натисніть на пункт меню 'BEEP вебсайт' щоб дізнатись, як отримати BEEP базу. Якщо у вас є власний пристрій вимірювання і ви хочете побачити дані в додатку BEEP, надішліть нам повідомлення, щоб приєднатися до нашої Slack спільноти та отримати доступ до опису API.",

  sample_code_hive:
    'Спочатку виберіть вулик, щоб згенерувати унікальний код зразка',
  sample_code_generate: 'Згенерувати унікальний код зразка',
  sample_code_delete: 'Видалити унікальний код зразка',

  measurement_interval: 'Інтервал',
  from_weather_service: 'від метеослужби',

  /* New translations v3 */
  last_visit: 'Останній візит',
  diary: 'Щоденник',
  data: 'Дані',
  photo: 'фото | фотографії',
  add_checklist: 'Додати контрольний список',
  add_hive: 'Додати вулик',
  edit_apiary: 'Редагувати пасіку',
  new_apiary: 'Нова пасіка',
  edit_group: 'Редагувати співпрацюючу група',
  new_group: 'Нова співпраціюча група',
  verification_code: 'Код підтвердження',
  confirm_email_title: 'Підтвердьте свою електронну адресу',
  confirm_email_summary:
    'Ви отримали код підтвердження на вашу електронну адресу. Введіть його нижче, щоб підтвердити свою електронну адресу',
  confirm: 'Підтвердити',
  Profile: 'Профіль',
  Checklist_template:
    'Шаблон контрольного списку | Шаблони контрольних списків',
  Help: 'Допомога',
  FAQ: 'Питання та відповіді',
  Support: 'Підтримка',
  no_inspections: 'Додайте перший огляд',
  no_results: 'Немає результатів',
  Hive_brood_layer: 'Розплідний корпус | Розплідні корпуси',
  Hive_honey_layer: 'Медовий корпус | Медові корпуси',
  Hive_queen_excluder_layer:
    'Корпус з роздільною решіткою | Корпуси з роздільною решіткою',
  Hive_feeding_box_layer: 'Корпус для годівниці | Корпуси для годівниці',
  overrides_layer_colors: 'замінює кольори корпуса',
  drag_layers: 'Перетягніть корпуси для налаштування вулика',
  page: 'сторінка | сторінки',
  Page: 'Сторінка | Сторінки',
  not_found: 'не знайдено',
  sorry: 'Вибачте',
  delete_layer: 'Видалити корпус',
  not_saved_error: 'Дані не можуть бути збережені',
  something_wrong: 'Щось пішло не так',
  not_editable: 'не редагується',
  unsaved_changes: 'Незбережені зміни',
  save_changes:
    'Ви впевнені, що хочете покинути цю сторінку? Усі незбережені зміни будуть втрачені.',
  no_apiaries_yet: 'У вас ще немає пасік',
  need_help: 'Потрібна допомога?',
  Apiary_color: 'Колір пасіки',
  Set_notification_date: 'Встановити дату сповіщення',
  remove_image: 'Видалити зображення',
  Total_colony_size: "Загальний розмір сім'ї",
  bee: 'бджола | бджоли',
  change_checklist_confirm:
    'Ви впевнені, що хочете вибрати інший контрольний список? Значення вже заповнених полів буде збережено.',
  view: 'Перегляд',
  remove_queen: 'Видалити матку',
  remove_group_short: 'Видалити співпрацюючу групу',
  device: 'Пристрій | Пристрої',
  click_date_to_edit: 'Натисніть на дату, щоб редагувати.',
  accept_policy_1: 'Я приймаю умови BEEP ',
  accept_policy_2:
    ', які відповідають новому європейському закону про конфіденційність',
  terms_of_use: 'умови використання',
  invalid_password:
    'Пароль повинен містити щонайменше 8 символів, одну малу літеру, одну велику літеру, одну цифру та один спеціальний символ (\\]{}()?\\-"!@#%&/\\,><\':;|_~`)',
  sensor_definition: 'визначення сенсора | визначення сенсорів',
  measurement: 'вимірювання | вимірювання',
  remove_device: 'Видалити пристрій',
  last_message_received: 'Останнє отримане повідомлення',
  transmission_ratio: 'Коефіцієнт передачі',
  period: 'Період',
  download: 'Завантажити',
  different_end_start: 'Дата закінчення та початку повинні відрізнятися',
  later_end_start: 'Дата початку повинна бути раніше за дату завершення',
  new_email_verification_sent:
    'Повідомлення з посиланням для підтвердження було надіслано на вашу нову електронну адресу. Натисніть на посилання в листі, щоб підтвердити нову адресу та увійти в систему.',
  sensordef_info:
    "Визначення датчика використовується для перетворення вихідного 'сирого' значення датчика у значення відповідно до фізичної величини та одиниці виміру (наприклад, w_v = 1098273 => weight_kg = 62,400 кг) або для калібрування сенсора (наприклад, t_0 = 15.3 °C => t_0 = 15.8 °C). Це можна зробити шляхом встановлення 'зміщення' та 'множника'. Вхідне та вихідне значення залишаться незмінними, якщо зміщення встановлено на '0', а множник — на '1'. Додаток BEEP base (з App Store) надасть вам правильні визначення датчиків під час початкового налаштування вашої бази BEEP.",
  sensordef_date_info:
    'Це калібрування застосовується від встановленої дати до цього часу (або іншого встановленого значення калібрування)',
  or: 'або',
  select_all_hives: 'Вибрати всі вулики',
  select_all_editable_hives: 'Вибрати всі редаговані вулики',
  Alert: 'Попередження | Попередження',
  alert: 'попередження | попередження',
  remove_alert: 'Видалити попередження',
  alerts_enabled: 'Попередження увімкнено',
  alerts_disabled: 'Попередження вимкнено',
  edit_checklist_confirm:
    'Ви впевнені, що хочете редагувати контрольний список? Усі незбережені зміни вашого огляду будуть втрачені.',
  edit_checklist_confirm_deselectedhives:
    'Ви впевнені, що хочете редагувати контрольний список? Усі незбережені зміни вашого огляду та вибору вуликів будуть втрачені.',
  user_not_edited:
    'Дані користувача не були змінені. Можливо, введені дані ідентичні вже наявним у базі даних або одне чи кілька полів заповнені некоректно. Будь ласка, перевірте свої дані та спробуйте ще раз.',
  user_not_deleted: 'Щось пішло не так, користувач не був видалений.',
  edit_hive_checklist_no_touch:
    'Позначте або зніміть позначки з пунктів у списку нижче, щоб додати або видалити елементи зі свого контрольного списку вуликів. Ви також можете згортати/розгортати та перетягувати елементи для зміни їх порядку відповідно до вашого стилю (зверніть увагу: це неможливо на пристроях із сенсорним екраном).',
  edit_hive_checklist_touch:
    "Позначте або зніміть позначки з пунктів у списку нижче, щоб додати або видалити елементи зі свого контрольного списку вуликів. Змінювати порядок елементів можна лише на настільному комп'ютері.",
  input_not_possible_for_bulkinspection:
    'Цей пункт недоступний під час вибору кількох вуликів для огляду, оскільки його можна заповнити лише для окремого вулика. Ви можете заповнити цей пункт пізніше, відредагувавши огляд для конкретного вулика.',
  save_bulkinspection_confirm:
    'Ви впевнені, що хочете зберегти цей огляд для кількох вуликів одночасно?',
  deleted_but_not_saved_devices_warning:
    "Зверніть увагу: пристрої будуть видалені лише після натискання кнопки 'Зберегти та видалити' у верхньому правому куті.",
  no_alerts: 'Немає нових попереджень',
  alertrule: 'правило попередження | правила попереджень',
  Alertrule: 'Правило попередження | Правила попереджень',
  Measurement: 'Вимірювання | Вимірювання',
  Calculation: 'Обчислення',
  calculation: 'обчислення',
  Direct: 'Безпосередньо',
  After: 'Після ',
  times: ' разів',
  Comparator:
    'Порівнювач' /*****************************************************************************************************************/,
  comparator: 'порівнювач',
  Comparison: 'Порівняння',
  comparison: 'порівняння',
  Threshold_value: 'Граничне значення',
  Minimum: 'Мінімум',
  Maximum: 'Максимум',
  Derivative: 'Похідна (збільшення або зменшення)',
  Count: 'Кількість',
  Value: 'Значення',
  Difference: 'Різниця',
  Absolute_value: 'Абсолютне значення',
  Absolute_value_of_dif_explanation: '**Абсолютне значення різниці',
  Exclude_months:
    '<strong>Деактивувати</strong> це попередження протягом наступних місяців:',
  Exclude_hours:
    '<strong>Деактивувати</strong> це попередження протягом наступних годин:',
  Exclude_hives:
    '<strong>Деактивувати</strong> це попередження для наступних вуликів:',
  Exclude_hives_details:
    'Зверніть увагу: за замовчуванням це попередження буде застосовуватися до всіх вуликів із вимірювальним пристроєм.',
  Exclude_hives_collab_group_exp:
    ' Це включає вулики з ваших співпрацюючих груп. Вимкніть вулики, для яких ви не хочете отримувати це попередження.',
  No_hives_excluded_warning:
    "Зверніть увагу: це попередження буде застосовуватися до всіх вуликів із вимірювальним пристроєм, включаючи вулики з ваших співпрацюючих груп. Ви можете вимкнути вулики, для яких не хочете отримувати це сповіщення, через 'Виключити періоди та вулики'.",
  Save_alertrule_ok: 'Бажаєте зберегти правило попередження?',
  months: 'місяці',
  hours: 'години',
  delete_alertrule: 'Видалити правило попередження',
  create_alertrule: 'Зберегти правило попередження',
  Active: 'Активне',
  Alert_via_email: 'Попередження через email',
  this_field: 'Це поле',
  alertrule_default: 'Типове правило попередження | Типові правила попереджень',
  copy: 'Копіювати',
  Home: 'Головна',
  Select_default_alertrule: 'Копіювати типове правило попередження',
  /* нижче, будь ласка, залиште всі терміни в [] без змін: */
  alertrule_main_sentence:
    'Я хотів би отримати попередження, якщо [calculation][comparison][measurement_quantity] [comparator] [threshold_value][measurement_unit]. Це обчислення буде виконано [calculation_minutes]',
  alertrule_occurences_direct_sentence:
    ', і я хотів би отримати попередження негайно. ',
  alertrule_exclude_months_sentence:
    'Це попередження буде деактивоване протягом наступних місяців: [exclude_months]. ',
  alertrule_exclude_hours_sentence:
    'Це попередження буде деактивоване протягом наступних годин: [exclude_hours]. ',
  alertrule_exclude_hives_sentence:
    'Це попередження буде деактивоване для наступних вуликів: [exclude_hive_ids].',
  Add_formula: 'Додати формулу',
  Explanation: 'Пояснення',
  db_influx: 'База даних Influx',
  lambda_model: 'Модель Lambda',
  open_weather: 'Open Weather',
  Past_minutes: 'за останні [nr_of_minutes]',
  Future_minutes: 'за наступні [nr_of_minutes]',
  Zero_period_minutes: 'лише за останнє значення',
  Not_relevant_for_period_zero:
    "Не застосовується, якщо розрахунок виконується лише за останнє значення (див. 'Період')",
  Only_comparison_available_for_source_type:
    "Єдиний доступний тип порівняння для вимірювань з цього джерела (див. 'Вимірювання')",
  Period_future: 'у майбутньому',
  Period_past: 'у минулому',
  Minutes_calculator: 'Калькулятор хвилин',
  min: 'мінімум',
  max: 'максимум',
  ave: 'середнє',
  der: 'похідна',
  cnt: 'кількість',
  equal_to: 'дорівнює',
  less_than: 'менше ніж',
  greater_than: 'більше ніж',
  less_than_or_equal: 'менше або дорівнює',
  greater_than_or_equal: 'більше або дорівнює',
  alertrule_not_active:
    "Це попередження було деактивовано. Ви можете активувати його, встановивши прапорець 'Активне' та зберігши це правило попередження.",
  export_email_sent: 'Електронний лист із файлом Excel було надіслано',
  excel_file_saved: "Файл Excel збережено у вашій папці 'Завантаження'",
  Updated_at: 'Оновлено о',
  Not_yet_saved: 'Ще не збережено',
  add_own_device: 'Додати власний пристрій',
  devices_info_text:
    "Зверніть увагу: у вас є BEEP base? Використовуйте додаток BEEP base для додавання вашого пристрою. Він автоматично з'явиться у списку нижче.",
  devices_url_text:
    'Тут ви можете знайти більше інформації про додаток BEEP base.',
  alert_explanation_1:
    'Якщо у вас є BEEP base або інший пристрій, ви можете налаштувати попередження, щоб отримувати повідомлення, коли дані вимірювань відповідають певним критеріям. Наприклад, різке зниження ваги через рій. Попередження будуть показані в цьому додатку, також ви можете отримувати їх на електронну пошту.',
  alert_explanation_2:
    'Щоб допомогти вам розпочати, є кілька стандартних правил попередження, які ви можете використовувати (і адаптувати під свої потреби). Крім того, ви можете створювати власні правила попереджень.',
  alertrules_url_text:
    "Перейдіть до 'Налаштувань попереджень', щоб створити своє перше правило попередження",
  Apiary_management: 'Управління пасікою',
  Move: 'Перемістити',
  Current_apiary: 'Поточна пасіка',
  sensor_key: 'Унікальний ідентифікатор пристрою',
  disabled_settings: 'Ручне редагування цих налаштувань вимкнено.',
  Address_placeholder: 'Номер, Назва вулиці, Місто',
  first_create_apiary: 'Спочатку створіть пасіку',
  Unknown: 'Невідомо',
  unknown: 'невідомо',
  research_warning:
    'Зверніть увагу: якщо ви не отримали запрошення на участь, вам не потрібно давати згоду на обмін даними, оскільки вони не будуть використовуватися в такому випадку.',
  research_explanation_p1:
    'Платформа BEEP використовується в дослідницьких проектах, перелічених нижче. Після того як вас запросять до участі в дослідницькому проекті, вам потрібно дати згоду на доступ дослідників до ваших бджолярських даних.',
  research_explanation_p2:
    'Ви можете відкликати свою згоду в будь-який момент. Після цього жодні нові дані не будуть передаватися. Дані, які ви надали в період, коли ви дали згоду, залишаться доступними для дослідження. У разі запитань звертайтеся до контактної особи вашого дослідницького проекту.',
  research_info:
    'Перш ніж дати згоду, перегляньте опис дослідження за наведеним нижче посиланням і за потреби запитайте додаткові деталі.',
  save_and_delete: 'Зберегти та видалити',
  drag_layers_info_text:
    'Перетягніть корпус з лівого боку в потрібне місце у вулику справа. Видаліть корпус, натиснувши на нього, а потім на іконку червоного кошика. Усередині вулика корпуси також можна перетягувати для зміни положення, а колір корпусу можна змінити, натиснувши на нього.',
  New_hive: 'Новий вулик',
  New_alertrule: 'Нове правило попередження',
  Add_alertrule: 'Додати правило попередження',
  Add_apiary: 'Додати пасіку',
  Add_sensor_definition: 'Додати визначення датчика',
  Add_member: 'Додати учасника',

  new_or_edited_but_not_saved_sensor_defs_warning:
    'Зверніть увагу: визначення датчиків будуть збережені або додані лише після натискання зеленої галочки підтвердження в кінці рядка визначення датчика в таблиці.',
  delete_sensordef: 'Видалити визначення датчика',
  delete_all_alerts: 'Видалити всі попередження',
  delete_all_alerts_warning:
    'Ви впевнені, що хочете видалити всі попередження? Це неможливо буде скасувати.',
  delete_all_alerts_warning_filter_active:
    'Ви впевнені, що хочете видалити всі попередження? Попередження, які не відповідають вашому пошуковому запиту, також будуть видалені. Це неможливо буде скасувати.',
  delete_selected_alert:
    'Видалити вибране попередження | Видалити вибрані попередження',
  delete_selected_alerts_warning:
    'Ви впевнені, що хочете видалити вибране попередження? Це неможливо буде скасувати. | Ви впевнені, що хочете видалити вибрані попередження? Це неможливо буде скасувати.',
  delete_selected_alerts_invisible_checked_warning:
    'Зверніть увагу: вибране попередження не відповідає вашому пошуковому запиту. | Зверніть увагу: є вибрані попередження, які не відповідають вашому пошуковому запиту, вони також будуть видалені.',
  already_verified: 'Я підтвердив свою електронну адресу та хочу увійти',
  password_recovery_resend_mail: 'Надіслати новий код підтвердження',
  alert_rule_created: 'Нове правило попередження створено',
  alert_rule_deleted: 'Правило попередження видалено',
  deactivate_for_all_hives: 'Деактивувати попередження для всіх вуликів',
  select_all: 'Вибрати все',
  During: 'Під час',
  Every: 'Кожні ', // контекст: як часто має виконуватися розрахунок правила попередження? -> кожні 15 хв, ..., кожні 24 години тощо.

  Calculation_minutes: 'Як часто потрібно виконувати обчислення?',
  Calculation_minutes_short: 'Як часто виконується обчислення?',
  Disable_alert_for_this_hive: 'Вимкнути сповіщення для цього вулика',
  Alert_disabled_for_this_hive: 'Сповіщення вимкнене для цього вулика',
  disabled_for_hive: 'було вимкнено для вулика',
  Alert_disabled: 'Сповіщення вимкнене',

  Log_data_import: 'Імпорт журналу даних',
  Log_files: 'Файли журналу', // Flashlogs
  Upload_date: 'Дата завантаження',
  Messages: 'Повідомлення',
  Log_time: 'Час у журналі',
  File_size: 'Розмір файлу',
  check_log_data: 'Перевірити дані журналу', // Check_flashlog
  delete_log_file: 'Видалити файл журналу', // Delete_flashlog
  commit_log_data_short: 'Імпортувати дані журналу', // commit_flashlog_short
  commit_log_data: 'Імпортувати дані з цього файлу журналу в застосунок BEEP: ', // commit_flashlog
  // flashlog_explanation
  import_log_data_explanation:
    "У застосунку BEEP base ви можете завантажити дані журналу з внутрішньої пам’яті BEEP base. Щоразу після завантаження даних журналу внутрішня пам’ять очищається, а дані передаються до застосунку BEEP. Нижче наведено список завантажених вами даних журналу. Ви можете переглянути ці дані, натиснувши кнопку 'Перевірити дані журналу'. В результаті перевірки ви побачите блоки даних, які можуть містити або не містити збіги з базою даних. Для кожного блоку, що містить збіги, ви можете переглянути дані журналу та бази даних у вигляді графіка, а також вибрати, чи доповнювати базу даних цими даними.",
  // flashlog_url_text
  import_log_data_url_text:
    'Тут ви знайдете статтю підтримки про завантаження даних журналу за допомогою застосунку BEEP base.',
  // flashlog_support_url
  import_log_data_support_url:
    'https://beepsupport.freshdesk.com/en/support/solutions/articles/60000697129-download-beep-base-data-through-bluetooth',

  Immediately: 'Негайно',
  alertrule_active_no_email_sentence:
    ', і я відкриваю застосунок BEEP, щоб переглянути сповіщення.',
  alertrule_active_email_sentence:
    ', і я отримую сповіщення електронною поштою. Крім того, я можу переглядати сповіщення у застосунку BEEP.',
  First_occurence: 'Перше',
  Last_occurence: 'Останнє',
  // default alert rule names:
  Hive_stability_and_theft: 'Стабільність вулика та крадіжка',
  Temperature_sensor_defect: 'Дефект датчика температури',
  Battery_low: 'Низька напруга акумулятора',
  Honey_harvest: 'Збір меду',
  Hive_temperature: 'Низька температура вулика',
  Brood_temperature: 'Низька температура розплоду',
  No_measurements: 'Немає вимірювань',
  Swarm: 'Рій',
  Food_supply_low: 'Низький запас корму',
  // default alert rule descriptions:
  Weight_drop_is_above_a_set_value:
    'Зниження ваги вулика перевищує встановлене значення',
  Temperature_sensor_malfunctions: 'Некоректна робота датчика температури',
  Battery_voltage_is_below_a_set_value:
    'Напруга акумулятора пристрою нижче встановленого значення',
  Weight_increase_due_to_nectar_collection_comes_to_a_halt:
    'Збільшення ваги через збір нектару припинилося',
  Hive_temperature_drops_below_a_set_value:
    'Температура у вулику знижується нижче встановленого значення',
  Temperature_in_the_brood_below_a_set_value:
    'Температура в розплоді впала нижче встановленого значення',
  No_measurement_data_received_in_a_set_time_period:
    'Не отримано даних вимірювань за встановлений період часу',
  Sudden_weight_drop_triggers_alert_immediately:
    'Раптове зниження ваги вулика негайно викликає сповіщення. *Зверніть увагу: це базується на інтервалі передачі даних 15 хвилин. Якщо ваш пристрій має інший інтервал передачі даних, слід відповідно скоригувати порогове значення.',
  The_hive_weight_is_below_a_set_value:
    'Вага вулика нижче встановленого значення',

  minute: 'хвилина | хвилини',
  upload_interval_warning_single_interval:
    'Зверніть увагу: інтервал передачі даних вашого пристрою становить | Зверніть увагу: інтервал передачі даних ваших пристроїв становить',
  upload_interval_warning_interval_range:
    'Зверніть увагу: інтервали передачі даних ваших пристроїв варіюються між',
  not_relevant_for_immediate_calculation:
    'Не має значення для негайного розрахунку',
  Increase: 'Збільшення',
  Decrease: 'Зменшення',
  Every_hour: 'Щогодини',
  every_hour: 'щогодини',
  Absolute_value_of_dif: 'Зміна', // context: 'Change' is an easier to understand word than 'the absolute value of the difference' between 2 values.
  In_case_of_good_connection_warning:
    "*Негайно після отримання вимірювання. Це залежить від інтервалу передачі даних і надійності з'єднання.",
  Alertrule_summary_title: 'Зведення',
  Alertrule_settings_title: 'Налаштування правил сповіщень',
  Alertrule_exclude_title: 'Виключення періодів і вуликів',
  of: 'з',

  alerts_url_text: 'Прочитайте статтю підтримки про сповіщення',
  alerts_support_url:
    'https://beepsupport.freshdesk.com/nl/support/solutions/articles/60000706484-alerts',

  /* New translations v3.0.74 */
  Decline: 'Відхилити',
  Decline_invitation: 'Відхилити запрошення',
  Decline_invitation_sure:
    'Ви впевнені, що хочете відхилити запрошення до групи?',
  selection: 'вибір',
  selection_placeholder: 'Виберіть період',
  data_zoom: 'Масштабування даних',
  data_zoom_ok: 'Бажаєте збільшити масштаб даних для ',
  data_zoom_out_ok: 'Бажаєте зменшити масштаб даних для ',

  Length: 'Довжина: ',
  match: 'співпадіння | співпадіння',
  Matches_found: 'Знайдено співпадінь',
  Firmware_version: 'Версія мікропрограми',
  Interval: 'Інтервал',
  View_data: 'Переглянути дані',
  show_all: 'Показати все',
  only_active_if_measurement_present:
    '*Зверніть увагу: ви отримаєте сповіщення про вибране вимірювання лише в тому випадку, якщо його зафіксував ваш пристрій BEEP.',
  Relative_startpoint: 'Відносний',

  Log_data: 'Журнал даних',
  Flashlog: 'Журнал',
  Block: 'Блок',
  Nr_of_match_props: 'Кількість однакових значень на кожне співпадіння',
  no_admin: 'Ви повинні бути адміністратором, щоб переглянути цю сторінку',

  import_block_data_short: 'Імпорт даних блоку',
  no_flashlog_data: 'Немає журналу данних',
  no_flashlog_file: 'Немає файлу журналу',
  no_device: 'Немає пристрою',
  data_not_stored: 'Дані не збережені',
  no_flashlog_found: 'Файл журналу не знайдено',
  Size: 'Розмір',
  Match: 'Співпадіння | Співпадіння',
  Missing_data: 'Відсутні дані',
  not_yet_in_db: 'ще немає в БД',
  From_cache: 'З кешу',
  Time_diff: 'ΔЧас',
  seconds_short: 'с',
  commit_block_data:
    'Додати дані з цього журналу данних в дані програми BEEP: ',
  persisted_measurements: 'Збережені вимірювання',
  persisted_days: 'Збережені дні',
  no_data_stored: 'Дані не збережено',
  data_stored_for_log: 'Дані збережено для журналу',
  Fill_holes: 'Заповнити прогалини (підключити всі точки даних)',

  Data_imported: 'Дані імпортовані',
  undo_import: 'Скасувати імпорт',
  undo_block_import_exp:
    'Ви впевнені, що хочете видалити раніше імпортовані дані з цього блоку з бази даних?',
  data_deleted: 'Дані видалено',
  data_not_deleted: 'Дані не видалено',
  deleted_measurements: 'Видалені вимірювання',
  deleted_days: 'видалено днів',
  Memory_erased: "Пам'ять BEEP очищена",
  Export: 'Експортувати',
  Export_as_json: 'Експортувати як JSON',
  Export_as_csv: 'Експортувати як .csv файл',
  Export_full_json: 'Експортувати повний JSON',
  Export_full_csv: 'Експортувати повний .csv',
  Export_file_being_saved:
    'Файл експорту буде збережено у вашій папці Завантаження - зачекайте будь ласка',
  no_data_deleted_because_no_matches_found:
    'Дані не видалено, оскільки не знайдено збігів',
  nr_of_measurements: 'кількість вимірювань',

  Now: 'Зараз',
  input_only_possible_when_date_present:
    "Будь ласка, спочатку виберіть 'дату огляду' (вище), щоб увімкнути форму огляду. Натисніть 'Зараз', щоб заповнити поточну дату та час.",
  select_inspection_date: 'Виберіть дату огляду',
  View_inspection_confirm: 'Бажаєте переглянути огляд для: ',

  /* Translations page */
  Translations: 'Переклади',
  translation_exp:
    'Щоб стати перекладачем, будь ласка, запитайте обліковий запис перекладача через support@beep.nl. Якщо ви хочете оновити переклади, будь ласка, завантажте .js файл нижче та надішліть оновлений файл на support@beep.nl. Дякуємо за ваші зусилля!',
  unpublished_exp: 'Переклади, які ще не опубліковані:',
  as_plain_text: 'як простий текст',

  /* Checklists page */
  new_checklist: 'Нова перевірка',
  duplicate: 'Дублювати',
  delete_checklist: 'Видалити перевірку',
  delete_checklist_confirm:
    "Ви впевнені, що хочете видалити цю перевірку? Це не можна скасувати. Перевірка: '",

  /* Menu items */
  View_measurements: 'Переглянути вимірювання',
  View_inspection: 'Переглянути огляд | Переглянути огляди',
  View_alert: 'Переглянути сповіщення | Переглянути сповіщення',

  Edit_alertrule: 'Редагувати правило сповіщення',
  Edit_hive: 'Редагувати вулик',
  Edit_queen: 'Редагувати матку',
  Edit_apiary: 'Редагувати пасіку',
  Edit_group: 'Редагувати співпрацюючу групу',
  Edit_group_short: 'Редагувати групу',
  Edit_checklist: 'Редагувати контрольний список',
  Edit_devices: 'Редагувати пристрої',
  Edit_consent: 'Редагувати згоду',
  Edit_hivetag: 'Редагувати мітку вулика',

  Hivetag: 'Мітка вулика | Мітки вуликів',
  Hivetag_exp_1:
    "‘Мітки вуликів’ — це QR-коди, які можна прикріпити до вулика, для яких можна налаштувати дію, яка буде виконана після сканування мітки вулика. 'Дія' означає дії в додатку BEEP, такі як створення нового огляду для відповідного вулика. Після налаштування мітки вулика вам достатньо відсканувати QR-код своїм смартфоном, і новий огляд буде автоматично створений. Ви можете самостійно роздрукувати мітки вуликів, завантаживши цей pdf.",
  Hivetag_download_text: 'завантажити цей pdf.',
  Hivetag_exp_2:
    'Просто відскануйте мітку вулика, щоб розпочати, ви будете автоматично перенаправлені на сторінку налаштування, якщо ще не було налаштовано дію.',
  qrcode: 'QR код | QR коди',
  Qrcode_exp1: "Прикріпіть мітку вулика з номером '",
  Qrcode_exp2: "' до вулика.",
  Qrcode_note:
    'Зверніть увагу: наведеним QR кодом не є фактична мітка вулика, він призначений лише як приклад.',
  Download_hivetags: 'Завантажити pdf міток вуликів',
  Delete_hivetag: 'Видалити мітку вулика',
  for_hive: 'для вулика "',
  Add_hivetag: 'Додати мітку вулика',
  Select_hivetag_number: 'Оберіть номер мітки вулика',
  Select_hive: 'Оберіть вулик | Оберіть вулики',
  Select_hive_for_hivetag_exp:
    'Для якого вулика ви хочете виконати дію? Оберіть один вулик.',
  Select_hivetag_action: 'Оберіть дію',
  Select_hivetag_action_exp:
    'Яку дію ви хочете виконати після сканування QR коду?',
  Hivetag_hive_in_overview: 'Показати вулик в огляді вуликів',
  Hivetag_new_inspection: 'Створити новий огляд',
  Hivetag_edit_hive: 'Редагувати налаштування вулика',
  Hivetag_view_inspections: 'Переглянути огляди',
  No_hivetags_left:
    'Всі мітки вуликів наразі використовуються. Видаліть існуючу мітку вулика, щоб додати нову, або змініть її.',

  Select_hives_for_consent: 'Оберіть вулики для згоди',
  Select_hives_for_consent_exp:
    'Оберіть вулики, даними яких ви хочете поділитися з цією дослідницькою роботою',
  View_alert_confirm: 'Чи хочете ви переглянути сповіщення "',

  /* iOS device prompt for adding BEEP app to home screen */
  pwa_title: 'Використовувати BEEP як додаток?',
  pwa_body:
    'Додайте BEEP на головний екран, щоб використовувати його як веб-додаток у повноекранному режимі. Ви залишатиметесь у системі після першого входу.',
  pwa_share_button_label:
    '1. Натисніть значок спільного доступу в нижньому меню.',
  pwa_addhome_button_label: "2. Натисніть 'Додати на головний екран'.",

  Colony: 'Колонія | Колонії',
  Dashboard: 'Панель керування | Панелі керування',
  Last_check: 'Остання перевірка',
  Note: 'Нотатка',
  no_chart_data_hive: 'Немає доступних даних для цього вулика',

  Code: 'Код',

  Dashboard_exp:
    "Створіть панель керування за допомогою кнопки 'Нова панель керування' у верхньому правому куті. Потім ви можете вибрати вулики, які хочете відобразити на загальнодоступній панелі керування за окремим посиланням (для всіх, хто має код). Вулики (та їхні вимірювання + останній огляд) відображатимуться по черзі.",
  create_dashboard_question:
    'Ще немає панелі керування? Створіть її в додатку BEEP',
  New_dashboard: 'Нова панель керування',
  Edit_dashboard: 'Редагувати панель керування',
  Delete_dashboard: 'Видалити панель керування',
  Logout_dashboard: 'Вийти',
  Logout_dashboard_check:
    'Ви впевнені, що хочете вийти / змінити панель керування?',
  weight_example_chart_1: 'Бджоли збирають нектар',
  weight_example_chart_2: 'Бджоли використовують свої запаси їжі',
  weight_example_chart_3: 'Рій!',
  weight_example_chart_4: 'Вулик було розширено',
  t_example_chart_1: '34°C: здоровий розплід',
  t_example_chart_2: '< 33°C: немає розплоду',
  Select_hives_for_dashboard_exp:
    'Які вулики ви хочете відобразити на цій панелі керування? Оберіть кілька вуликів (до 12) для оптимального ефекту. Для вуликів з пристроєм будуть відображені дані про температуру та вагу (якщо вони є). Можна вибрати лише власні вулики.',
  Max_hives_warning: 'Досягнуто максимальну кількість вуликів',
  Title: 'Заголовок',
  Dashboard_title_exp:
    "Заголовок за замовчуванням — 'Панель керування' (якщо не вказано інше).",
  Dashboard_description_exp:
    'Зверніть увагу: цей опис не буде показано на панелі керування. Він може використовуватися для збереження додаткової інформації, наприклад, для кого призначена ця панель.',
  Pace: 'Частота (секунди)',
  Dashboard_pace_exp: 'Частота зміни вуликів на екрані (у ротації)',
  Dashboard_interval_exp:
    'Показувати дані вимірювань за попередню годину/день/тиждень/місяць/рік або за власний період',
  Show_inspections: 'Показувати огляди',
  Show_inspections_exp:
    'Показувати останній огляд (дату, загальне враження та нотатку).',
  Show_all_hives: 'Показувати деталі всіх вуликів',
  Show_all_hives_exp:
    'Показувати деталі (місцезнаходження, останній огляд, дані вимірювань) для всіх обраних вуликів (ТАК) або тільки для вуликів із пристроєм (НІ, рекомендований варіант).',
  Preview_share: 'Попередній перегляд і спільний доступ',
  Copy_url: 'Скопіювати посилання',
  /* offline inspection sheet */
  Hour_short: 'Год | Год',
  Day: 'День | Дні',
  Minute: 'Хвилина | Хвилини',
  Percentage_exp: 'Відсоток між 0 і 100',
  Grade_exp_1: 'Оцінка від 1 до 10',
  Grade_exp_2: '(1 = Погано, 10 = Відмінно)',
  Degrees_exp_1: 'Кількість градусів між',
  Degrees_exp_2: '-180° і 180°',
  Negative_exp: "Від'ємне число (менше 0)",
  Too_many_items_exp_1: 'Забагато варіантів для',
  Too_many_items_exp_2: 'друку, введіть власну відповідь',
  Image_placeholder_1: 'Це зображення можна додати пізніше',
  Image_placeholder_2: "через додаток BEEP (необов'язково)",
  Samplecode_placeholder_1: 'Код зразка може бути згенерований під час',
  Samplecode_placeholder_2: 'завантаження огляду в додаток BEEP',
  Too_long_list_present:
    'Список варіантів надто довгий для відображення в офлайн-чеклисті для елемента:',
  Too_long_list_present_fix_1: 'Якщо можливо, зменште кількість варіантів до',
  Too_long_list_present_fix_2:
    "або менше через кнопку 'Редагувати чеклист'. Або введіть правильну відповідь вручну.",

  Print: 'Друк',
  Print_checklist: 'Друкувати чеклист',
  Print_checklist_exp:
    'Переконайтеся, що використовуєте такі налаштування принтера:',
  Print_checklist_exp_1: 'Формат паперу: A4',
  Print_checklist_exp_2: 'Без полів',
  Print_checklist_exp_3: 'Чорно-білий друк',
  Print_checklist_exp_4: 'Односторонній друк',

  /* inspection modes */
  Offline_inspection: 'Паперовий огляд',
  Offline_inspection_exp:
    "Роздрукуйте чеклист, заповніть його вручну. Пізніше завантажте фото ваших оглядових листів через кнопку 'Завантажити паперовий огляд'. Потім фото будуть автоматично оброблені, і їх можна буде перевірити та зберегти як звичайну (цифровий/онлайн) огляд.",
  Online_inspection: 'Цифровий огляд',
  Online_inspection_exp:
    'Заповнюйте чеклист у цифровому вигляді (онлайн) через комп’ютер, планшет або смартфон, як ви звикли',
  Upload_inspection: 'Завантажити паперовий огляд',
  Upload_inspection_exp:
    'Якщо ви заповнили  паперовий огляд, тут можна завантажити фото ваших оглядових листів. Вони будуть автоматично оброблені, і їх можна буде перевірити та зберегти як звичайну (цифровий/онлайн) огляд.',
  Select_inspection_mode: 'Виберіть режим огляду',
  Send_pictures: 'Надіслати зображення',
  svg_checklist: 'надрукований чеклист | надруковані чеклисти',
  Select_input_language: 'Виберіть мову, якою було заповнено чеклист',
  Upload_images: 'Завантажити зображення',
  Upload_images_exp:
    'Будь ласка, зверніть увагу на наступне під час фотографування:',
  Upload_images_exp_1:
    'Чи збігається Print ID кожної сторінки з Print ID вибраного надрукованого чеклиста?',
  Upload_images_exp_2: 'Чи видно всі 4 чорні квадрати?',
  Upload_images_exp_3:
    'Чи добре освітлений папір і чи лежить на рівній поверхні?',
  Upload_images_exp_4: 'TODO: використати сканер зображень?',
  Uploading_images_be_patient:
    'Будь ласка, зачекайте, зображення обробляються. Це може зайняти кілька хвилин. Не закривайте це вікно.',
  Generating_svg_be_patient:
    'Будь ласка, зачекайте, ваш чеклист для друку генерується. Це може зайняти деякий час. Не закривайте це вікно.',
  Parsed_pages: 'Оброблені сторінки',
  Number_of_processed_pages: 'Кількість оброблених сторінок: ',
  Incorrectly_uploaded_pages: 'Неправильно завантажені сторінки: ',
  Missing_page: 'Відсутня сторінка | Відсутні сторінки',
  Check_svg_id_for_page:
    'Перевірте Print ID для сторінки | Перевірте Print ID для сторінок',
  correct_svg_id: 'правильний Print ID',
  Svg_id_exp:
    'Print ID можна знайти у верхньому правому куті сторінки, ліворуч від номера сторінки. Завантажте паперовий огляд знову з правильними сторінками та/або виберіть правильний надрукований чеклист',
  All_svg_ids_correct: 'Вибрано правильний надрукований чеклист',
  All_svg_ids_incorrect: 'Вибрано неправильний надрукований чеклист',
  No_checklist_svg: 'Чеклисти ще не були надруковані',
  No_checklist_svg_exp:
    "Перед завантаженням паперового огляду спочатку потрібно роздрукувати (і заповнити) чеклист. Перейдіть до 'Паперовий огляд', щоб роздрукувати чеклист, або замість цього відправте повністю цифровий огляд через 'Цифровий огляд'.",
  checklist_svg_exp:
    "Будь ласка, виберіть надрукований чеклист нижче. Переконайтеся, що Print ID (а отже, і назва) збігається з Print ID (і назвою) вашої паперового огляду. Print ID знаходиться у верхньому правому куті кожної сторінки, а назва — у верхньому лівому. Зверніть увагу: цифровий чеклист може бути збережений як 'надрукований чеклист' під різними Print ID, якщо його вміст змінювався між друкованими сесіями. Тому зміни в цифровому чеклисті відображаються в друкованому лише після його повторного друку. Дата (і час) після назви вказують, коли певна версія чеклиста була вперше надрукована.",

  /* Compare module */
  Load: 'Завантажити',
  Compare: 'Порівняти',
  Select_hives_for_compare: 'Виберіть вулики для порівняння',
  Select_hives_for_compare_exp:
    'Виберіть вулики, з якими ви хочете порівняти дані',
  mean_weight_kg: 'Середня вага',
  mean_net_weight_kg: 'Середня чиста вага',
  net_weight_kg: 'Чиста вага',
  overall_intake_loss: 'Загальний приріст/втрата',
  Compare_hives: 'Порівняти вулики',
  Compare_with_mean: 'Порівняти вагу вулика із середньою вагою інших вуликів',
  compare_hives_exp:
    'Дізнайтеся, як розвивається ваш вулик у порівнянні з іншими вуликами у вашій місцевості.',
  compare_support_url:
    'https://beepsupport.freshdesk.com/en/support/solutions/articles/60000921124-compare-hives-option',
  compare_url_text:
    'Тут ви можете знайти більше інформації про функцію порівняння',
  selected_hive: 'вибраний вулик | вибрані вулики',
  Multiple_hives_charts: 'Порівняння кількох вуликів в одному графіку',
  compare_no_chart_data: 'Немає даних для порівняння за вибраний період',
  multiple_hives_no_chart_data:
    'Немає даних для вибраних вуликів за вибраний період',
  /* below, please keep [hivename] as is, it will be replaced by the name of the hive you selected in the Data tab */
  compare_chart_exp:
    'Зверніть увагу: [hivename] не буде включено в розрахунок середньої ваги.',

  /* below, please keep [pagenr] as is, it will be replaced by the pagenumber to be uploaded */
  Upload_pagenr: 'Завантажте сторінку [pagenr] тут',
  Datetime_of_inspection: 'Дата та час огляду',
  remind_datetime: 'Дата та час нагадування',

  cumulative_daily_weight_anomaly: 'Кумулятивна аномалія щоденної ваги',
  colony_failure_weight_history:
    'Ймовірність зимової загибелі колонії на основі історії ваги',
  more_info: 'докладніше',

  api_token: 'API токен',
  save_api: 'Зберегти API токен',

  // TODO-VUE3 refactor into single term with prop
  Fav_group_exp: 'Додати цю групу до вибраних',
  Fav_apiary_exp: 'Додати цю пасіку до вибраних',
  Fav_exp:
    ' - вона буде показана на початку списку та завантажиться першою (перед іншими)',
}

export default translations
